Tekla Open API Reference for Tekla Structures 2025
Arc.StartTangent Property
 Gets the unit vector tangent to the start point which defines the Y axis of the arc coordinate system
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Vector StartTangent { get; }
Public ReadOnly Property StartTangent As Vector
	Get
Property Value
Type: Vector
See Also
Reference
Arc Class
Tekla.Structures.Geometry3d Namespace